IDEA Open Model
CoordSystem Class
Compatible with IDEA StatiCa 20.1
 Coordinate system base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.CoordSystem
 IdeaRS.OpenModel.Geometry3D.CoordSystemByPoint
 IdeaRS.OpenModel.Geometry3D.CoordSystemByVector
 IdeaRS.OpenModel.Geometry3D.CoordSystemByZup
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class CoordSystem : OpenObject
Public MustInherit Class CoordSystem
	Inherits OpenObject
The CoordSystem type exposes the following members.
Constructors
Name | Description
CoordSystem
Initializes a new instance of the CoordSystem class
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace